package day08;

public class Phone { // class s     // Phone의 속성과 행동을 정의하는 틀
    // 클래스내 멤버
    // 1. 멤버변수( 객체내 포함되는 변수 )
    String model;   // 멤버변수(객체의 속성) , Phone 모델명
    String color;   // 멤버변수(객체의 속성) , Phone 색상
    int price;      // 멤버변수(객체의 속성) , Phone 가격

    // 2. 생성자
        // 1) 기본생성자 :
            // -> 클래스내 생성자가 없으면 자동으로 (컴파일될때) 생성된다.
            // -> 클래스내 하나 이상의 생성자가 있을때는 직접 기본생성자 정의
    Phone(){
        System.out.println("--> Phone 기본생성자 실행");

    } // func end , 매개변수 0개

        // 2) 매개변수( 해당 메소드/생성자 호출시 외부로부터 들어오는값 )가 있는 생성자
            // -> 생성자는 매개변수는 있지만 반환값이 없다.
    Phone( String pModel , String pColor ){     // 
        // Phone( 생성자 ) 은 같지만 ( 매개변수의 타입/개수/순서 )
        // ( )소괄호 안의 매개변수가 다를 수 있음 ---> 메소드를 여러개 정의할 수 있게 해주는 기능을 오버로드
        // --> 외부로부터 전달받은 인자값이 저장된 매개변수 값을 맴버변수에 저장
        model = pModel; // 내부변수 = 외부변수 대입
        color = pColor;
        price = 1200000; // 초기값을 임의로 고정한다. 120만원
    } // func end  , 매개변수 2개

        // 3) 생성자의 오버로드
            // -> 기존 생성자와 매개변수의 타입/순서/개수 다르면 오버로드 , 변수명이 다르다고 오버로드 되는 건 아님
    Phone( String model , String color , int price ){
            // ----> 멤버변수 : 객체내 변수
            // ----> 매개변수 : 메소드/생성자가 사용되는 인수값 저장변수
            // 문제점 : 이름이 같다... 멤버변수의 model 과 매개변수의 model 이름이 같음
            // 해결책 : this 키워드 : 현재 메소드/생성자를 호출한 객체 가리킨다.
            this.model = model;
            this.color = color;
            this.price = price;
            // ----> 'model'이라는 매개변수를 받아서 'model'이라는 멤버변수에 저장할 거라는 뜻
            // this 안쓰고 이름 다르게 한다? : 관례적으로 초기화 값은 멤버변수명과 매개변수명을 동일하게 한다.

    } // func end , 매개변수 3개

    // 3. 메소드 : 클래스 안에 정의된 함수 , 객체가 수행할 '동작(기능)을 정의함' === 클래스 안에 정의된 '함수'

} // class e
