package 심화.심화과제2;

public class BankController2 {

    // 클래스 3개 생성
    // 객체 100개 저장할 수 있는 배열 생성
    // 매개변수로 입력받을 값 지정 -> 생성자 생성 시 같이 할 예정
    // 메소드 생성

    // 1. 계좌등록 메소드
    // 2. 입금 메소드
        // 1) 입금 성공 시 출력 기능
        // 2) 계좌번호 다를 때 , 입금 실패 출력 기능
    // 3. 출금 메소드
        // 1) 출금 성공 시 출력 가능
        // 2) 출금 잔액 부족 시 , 출금 실패 출력 기능
    // 4. 잔고 출력 메소드
        // 1. 출금 , 입금 시 누적 증감 기능
        // 2. 이체 했을 때 , 누적 차감 기능
        // 3. 이체 받았을 때 , 누적 더하기 기능
    // 5. 계좌이체 메소드
        // 1. 성공 시 출금 (누적 차감)
        // 2. 비밀번호 오류 시 경고 메시지
        // 2. 잔액 부족 시 잔액부족 메시지
    // 메소드 호출
    // 출력

    Account2 [ ] account2s = new Account2[100];

    private boolean GetAccount(String account ,int password){

        return true;
    }

}
